import os
os.system('CLS')#clear для систем Linux

import random
k = 1
answer = 0
while k > 0:
    print('┌────────────────────────┐')
    print('│ Хочешь сыграть в игру? │')
    print('└────────────────────────┘')
    answer = input()
    if answer.lower() in ('да','ага','угу','даа','давай','ок','окей','yes','yea','yeap','lf','согласен','почему бы и нет','спрашиваешь','ад','хочу'):
        print('┌────────────────────────────────────────────────────────┐')
        print('│ ОТЛИЧНО! Теперь мы сыграем в ......... УГАДАЙ ЧИСЛО!!! │')
        print('└────────────────────────────────────────────────────────┘')
        print('┌────────────────────────────────────────────────────────┐')
        print('│ Правила простые. Я загадываю число от 1 до 1000        │')
        print('│ после ты пытаешься его угадать, а я буду говорить,     │')
        print('│ больше оно или меньше. У тебя всего 10 попыток. Удачи  │')
        print('└────────────────────────────────────────────────────────┘')

        def valid(n):
            if n.isdigit() == True and 1<=int(n)<= 1000:
                return True
            else:
                return False

        num = 0     
        count = 0
        etalon = 1000
        c = 0
  
        print('┌────────────────────────────────┐')
        print('│ Я загадал, итак, твой вариант? │')
        print('└────────────────────────────────┘')
        cel = random.randrange(1, 1000)

        while num != cel or count < 11:
               
                num = input()
                if valid(num) == False:
                    print('┌───────────────────────────────────────────────────────────────────┐')
                    print(' Ты кажется не понял, надо вводить ИМЕННО числа от 1 до 1000!!!     ')
                    print(' Не буквы, не пробелы, не символы а именно числа в диапазоне!!!     ')
                    print('└───────────────────────────────────────────────────────────────────┘')
                if valid(num) == True:
                    if int(num) > int(cel):
                        count += 1
                        print('┌────────────────────────────────┐')
                        print('│Стоит попробовать число поменьше│')
                        print('└────────────────────────────────┘')
                        print('┌─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┐')
                        print('  Колличество попыток:',count)
                        print('└─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┘')
                    if  int(num) < int(cel):
                        count += 1
                        print('┌──────────────────────────────────┐')
                        print('│ Стоит попробовать число побольше │')
                        print('└──────────────────────────────────┘')
                        print('┌─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┐')
                        print('  Колличество попыток:',count)
                        print('└─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┘')
                    if int(num) == int(cel):
                        count += 1
                        print('┌────────────────────────────────────────┐')
                        print('│ А ты хорош, уагадал число. Поздравляю! │')
                        print('└────────────────────────────────────────┘')
                        print('┌─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┐')
                        print('  Колличество попыток:',count)
                        print('└─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─ ─┘')
                        break
                        k = 1
                    if(count == 10):
                        print('┌──────────────────────────────────────────────┐')
                        print('│ Мне оченб жаль, но за 10 попыток ты проиграл │')
                        print('└──────────────────────────────────────────────┘')
                        input()
                        break
                        k = 1
                    
    elif answer.lower() in ('нет','неа','нте','нае','no','nope','отстань','не хочу','ytn'):
        print('┌──────────────────────────────────────────────┐')
        print('│ А чего тогда игру запускал... Ну ладно, пока │')
        print('└──────────────────────────────────────────────┘')
        input()
        k = -1

    else:
        print('┌────────────────────────────────────┐')
        print('│Я тебя не понимаю, давай еще раз... │')
        print('└────────────────────────────────────┘')        

